List<String> ukrainianNames1 = [
  'Андрій', 'Богдан', 'Віталій', 'Ганна', 'Денис', 'Євген', 'Жанна', 'Зоряна', 'Іван', 'Ірина',
  'Кирило', 'Леся', 'Марія', 'Наталія', 'Олег', 'Павло', 'Руслан', 'Світлана', 'Тарас', 'Уляна',
  'Федір', 'Христина', 'Цезар', 'Чеслав', 'Шевченко', 'Щербань', 'Юлія', 'Ярослав', 'Валерія', 'Валентин',
  'Василь', 'Віра', 'Галина', 'Григорій', 'Данило', 'Діана', 'Єлизавета', 'Злата', 'Ігор', 'Катерина',
  'Людмила', 'Максим', 'Микола', 'Оксана', 'Олена', 'Роман', 'Сергій', 'Софія', 'Юрій', 'Яна'
];

List<String> ukrainianNames2 = [
  'Аліна', 'Арсен', 'Богдана', 'Вадим', 'Валентина', 'Василина', 'Віктор', 'Вікторія', 'Геннадій', 'Георгій',
  'Дмитро', 'Дарина', 'Єва', 'Жанна', 'Зінаїда', 'Ілля', 'Інна', 'Кирило', 'Ксенія', 'Лариса',
  'Леонід', 'Лілія', 'Любов', 'Маргарита', 'Марина', 'Марта', 'Мирослава', 'Михайло', 'Назар', 'Олеся',
  'Ольга', 'Орест', 'Петро', 'Поліна', 'Радислав', 'Ростислав', 'Світлана', 'Семен', 'Станіслав', 'Степан',
  'Тетяна', 'Устим', 'Федір', 'Христина', 'Юлія', 'Яків', 'Яна', 'Ярослава', 'Ярослав', 'Ярина'
];